<template>
    <div class="sjh">
        <div class="mh100vw bgfff fsize14 mt16 pl20 pr20 pt20 pb20 b-rad4">
            <table class="eval-table wid100p center col333" border="1">
                <tr class="h56 b bgfa">
                    <td class="">部门</td>
                    <td class="">完成情况<br/>（万）</td>
                    <td class="">增速目标</td>
                    <td class="">完成进度</td>
                    <td class="">任务数</td>
                    <td class="">完成进度</td>
                    <td class="">目标</td>
                    <td class="">完成进度</td>
                </tr>
                <tr class="h56" :class="[{bgfa:index%2==1}]" v-for="(item,index) in list" :key="index">
                    <td class="">{{item.b}}</td>
                    <td class="">{{item.d1}}</td>
                    <td class="">{{item.d2}}</td>
                    <td class="">{{item.d3}}</td>
                    <td class="">{{item.d4}}</td>
                    <td class="">{{item.d5}}</td>
                    <td class="">{{item.d6}}</td>
                    <td class="">{{item.d7}}</td>
                </tr>
            </table>
        </div>
    </div>
</template>
<script>
export default {
    data(){
        return {
            list:[
                {b:'北山街道',d1:'8883.4',d2:'18.00%',d3:'15.40%',d4:'20',d5:'5',d6:'100%',d7:'93%'},
                {b:'西溪街道',d1:'26848.5',d2:'18.00%',d3:'10.50%',d4:'20',d5:'4',d6:'100%',d7:'93%'},
                {b:'灵隐街道',d1:'1041.3',d2:'18.00%',d3:'7.60%',d4:'20',d5:'1',d6:'100%',d7:'93%'},
                {b:'翠苑街道',d1:'35.3',d2:'20.00%',d3:'9.30%',d4:'20',d5:'2',d6:'100%',d7:'93%'},
                {b:'文新街道',d1:'1612.5',d2:'20.00%',d3:'2.60%',d4:'20',d5:'2',d6:'100%',d7:'93%'},
                {b:'古荡街道',d1:'911589.2',d2:'22.00%',d3:'89.00%',d4:'25',d5:'4',d6:'100%',d7:'93%'},
                {b:'蒋村街道',d1:'15661.3',d2:'18.00%',d3:'5.00%',d4:'25',d5:'6',d6:'100%',d7:'93%'},
                {b:'转塘街道',d1:'473.7',d2:'20.00%',d3:'46.00%',d4:'30',d5:'10',d6:'100%',d7:'93%'},
                {b:'留下街道',d1:'22299.0',d2:'20.00%',d3:'70.00%',d4:'30',d5:'12',d6:'100%',d7:'93%'},
                {b:'三墩镇',d1:'7735.3',d2:'20.00%',d3:'22.00%',d4:'30',d5:'9',d6:'100%',d7:'93%'},
                {b:'双浦镇',d1:'2375.6',d2:'18.00%',d3:'47.00%',d4:'35',d5:'15',d6:'100%',d7:'93%'},
                {b:'云栖小镇',d1:'268321.4',d2:'20.00%',d3:'32.00%',d4:'35',d5:'14',d6:'100%',d7:'93%'},
                {b:'紫金港科技城',d1:'17864.6',d2:'18.00%',d3:'14.00%',d4:'40',d5:'25',d6:'100%',d7:'93%'},
                {b:'全区合计',d1:'1284741.1',d2:'20.00%',d3:'66.39%',d4:'350',d5:'109',d6:'100%',d7:'93%'},
            ]
        }
    },
    mounted(){
        this.$getPageHeight();
    },
    methods:{
        
    }
}
</script>7