<template>
    <div class="sjh">
        <div class="mh100vw bgfff fsize14 mt16 pl20 pr20 pt20 pb20 b-rad4">
            <table class="eval-table wid100p center col333" border="1">
                <tr class="h56 b bgfa">
                    <td class="">部门</td>
                    <td class="">网办实现率</td>
                    <td class="">掌办实现率</td>
                    <td class="">平均跑动次数</td>
                    <td class="">即办率</td>
                    <td class="">承诺时限压缩比</td>
                </tr>
                <tr class="h56" :class="[{bgfa:index%2==1}]" v-for="(item,index) in list" :key="index">
                     <td class="">{{item.b}}</td>
                    <td class="">{{item.w}}</td>
                    <td class="">{{item.z}}</td>
                    <td class="">{{item.p}}</td>
                    <td class="">{{item.j}}</td>
                    <td class="">{{item.c}}</td>
                </tr>
            </table>
        </div>
    </div>
</template>
<script>
export default {
    data(){
        return {
            list:[
                {b:'区税务局',w:'100.00%',z:'100.00%',p:'0.0000',j:'16.67%',c:'72.50%'},
                {b:'西湖规资分局',w:'100.00%',z:'100.00%',p:'0.0000',j:'86.36%',c:'97.85%'},
                {b:'区住建局',w:'100.00%',z:'100.00%',p:'0.0000',j:'97.30%',c:'99.33%'},
                {b:'区市场监管局',w:'100.00%',z:'99.39%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区人社局',w:'100.00%',z:'99.25%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区发改经信局',w:'100.00%',z:'100.00%',p:'0.0000',j:'100%',c:'100%'},
                {b:'西湖消防救援大队',w:'100.00%',z:'100.00%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区城管局',w:'100.00%',z:'100.00%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区委办(区档案局)',w:'100.00%',z:'100.00%',p:'0.0000',j:'100%',c:'100%'},
                {b:'西湖生态环境分局',w:'100.00%',z:'100.00%',p:'0.0000',j:'100%',c:'100%'},

                {b:'区文广旅体局',w:'100.00%',z:'100.00%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区财政局',w:'100.00%',z:'100.00%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区委宣传部(区新闻出版局)',w:'100.00%',z:'100.00%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区司法局',w:'100.00%',z:'100.00%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区农业农村局',w:'99.41%',z:'99.41%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区卫健局',w:'99.03%',z:'99.03%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区民政局',w:'95.65%',z:'94.78%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区教育局',w:'95.00%',z:'95.00%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区应急管理局',w:'94.44%',z:'88.89%',p:'0.0000',j:'100%',c:'100%'},
                {b:'区委统战部(区民宗局、区侨办)',w:'91.67%',z:'91.67%',p:'0.0000',j:'63.64%',c:'74.49%'},
                {b:'西湖公安分局',w:'79.23%',z:'92.31%',p:'0.1176',j:'66.67%',c:'91.37%'},

                {b:'区商务局',w:'100.00%',z:'100.00%',p:'/',j:'/',c:'/'},
                {b:'区残联',w:'100.00%',z:'85.71%',p:'/',j:'/',c:'/'},
                {b:'区科技局',w:'100.00%',z:'100.00%',p:'/',j:'/',c:'/'},
                {b:'区退役军人局',w:'100.00%',z:'100.00%',p:'/',j:'/',c:'/'},
                {b:'区统计局',w:'100.00%',z:'100.00%',p:'/',j:'/',c:'/'},
                {b:'区委政法委',w:'100.00%',z:'0.00%',p:'/',j:'/',c:'/'},
            ]
        }
    },
    mounted(){
        this.$getPageHeight();
    },
    methods:{
        
    }
}
</script>7